import FaqItem from "./FaqItem";

export default function FaqList() {
  const stagesList = [
    {
      title: "Що включає в себе тур від нашого агенства?",
      description:
        "Rich Tour пропонує професійні рішення для корпоративних клієнтів. Ми знаємо, як важливо забезпечити комфорт, ефективність та бездоганну організацію для вашого бізнесу.",
    },
    {
      title: "Що включає в себе тур від нашого агенства?",
      description:
        "Rich Tour пропонує професійні рішення для корпоративних клієнтів. Ми знаємо, як важливо забезпечити комфорт, ефективність та бездоганну організацію для вашого бізнесу.",
    },
    {
      title: "Що включає в себе тур від нашого агенства?",
      description:
        "Rich Tour пропонує професійні рішення для корпоративних клієнтів. Ми знаємо, як важливо забезпечити комфорт, ефективність та бездоганну організацію для вашого бізнесу.",
    },
    {
      title: "Що включає в себе тур від нашого агенства?",
      description:
        "Rich Tour пропонує професійні рішення для корпоративних клієнтів. Ми знаємо, як важливо забезпечити комфорт, ефективність та бездоганну організацію для вашого бізнесу.",
    },
    {
      title: "Що включає в себе тур від нашого агенства?",
      description:
        "Rich Tour пропонує професійні рішення для корпоративних клієнтів. Ми знаємо, як важливо забезпечити комфорт, ефективність та бездоганну організацію для вашого бізнесу.",
    },
  ];

  return (
    <ul className="flex flex-col gap-y-4 xl:gap-y-5">
      {stagesList.map((faqItem, idx) => (
        <FaqItem key={idx} faqItem={faqItem} />
      ))}
    </ul>
  );
}
