export const mission = {
  title: "Нові горизонти",
  description:
    "Приєднуйтесь до нас, і разом ми відкриємо світ цікавих подорожей!",
  content: {
    partOne: {
      text: "Ми віримо, що подорожі – це не просто переміщення з точки А до точки Б, а можливість відкрити нові горизонти, пізнати інші культури та знайти нових друзів. Тому ми намагаємося забезпечити найвищу якість обслуговування, комфорт та безпеку під час кожного туру.",
      image: { url: "/images/mockedPhoto/sea.webp", alt: "sea" },
    },
    partTwo: {
      text: "Наша мета – зробити ваш відпочинок максимально приємним і безтурботним. Завдяки індивідуальному підходу до кожного клієнта, ми готові врахувати всі ваші побажання та запропонувати саме те, що ви шукаєте.",
      image: { url: "/images/mockedPhoto/airplane.webp", alt: "airplane" },
    },
  },
};
