export const faqList = [
  {
    title: "Що включає в себе тур від нашого агенства?",
    description:
      "Rich Tour пропонує професійні рішення для корпоративних клієнтів. Ми знаємо, як важливо забезпечити комфорт, ефективність та бездоганну організацію для вашого бізнесу.",
  },
  {
    title: "Що включає в себе тур від нашого агенства?",
    description:
      "Rich Tour пропонує професійні рішення для корпоративних клієнтів. Ми знаємо, як важливо забезпечити комфорт, ефективність та бездоганну організацію для вашого бізнесу.",
  },
  {
    title: "Що включає в себе тур від нашого агенства?",
    description:
      "Rich Tour пропонує професійні рішення для корпоративних клієнтів. Ми знаємо, як важливо забезпечити комфорт, ефективність та бездоганну організацію для вашого бізнесу.",
  },
  {
    title: "Що включає в себе тур від нашого агенства?",
    description:
      "Rich Tour пропонує професійні рішення для корпоративних клієнтів. Ми знаємо, як важливо забезпечити комфорт, ефективність та бездоганну організацію для вашого бізнесу.",
  },
  {
    title: "Що включає в себе тур від нашого агенства?",
    description:
      "Rich Tour пропонує професійні рішення для корпоративних клієнтів. Ми знаємо, як важливо забезпечити комфорт, ефективність та бездоганну організацію для вашого бізнесу.",
  },
];
